app/Http/Controllers/Api/ApiController.php

    public function getItems(Request $request)
    {
        $data = Item::orderBy('name')->get();
---
select * from `items` order by `name` asc

    public function getIntOut()
    {
        $data = StocksOut::distinct('int_id')->orderBy('int_no', 'DESC')->pluck('int_no');
---
select distinct `int_no` from `stocks_outs` order by `int_no` desc

    public function getMember()
    {
        $data = Member::orderBy('name')->get();
---
select * from `members` order by `name` asc