app/Http/Controllers/StocksController.php

select * from `items` order by `name` asc limit 15 offset 0
select count(*) as aggregate from `items`
select * from `items` order by `updated_at` desc limit 15 offset 0
---
    public function index(){
        $datas = Item::orderBy('name')->paginate();
        $rank = $datas->firstItem();

select * from `items`
---
    public function createPDF() {
       $datas = Item::all()->sortBy('name');