app/Http/Controllers/StocksOutController.php

select * from `items` where `items`.`id` in (20, 21, 42, 66, 67, 84, 100, 106, 165, 173, 177)
select * from `members` where `members`.`id` in (5, 55, 81)
---
    public function index()
    {
        $datas = $this->table::orderBy('int_no', 'DESC')->with('member')->with('item')->paginate();

select * from `items` where `items`.`id` in (20, 30, 42, 48, 77, 89, 105, 124, 126, 127, 144, 146)
select * from `members` where `members`.`id` in (2, 66, 72)
---
    public function index_advance_search()
    {
        $datas = $this->table::orderBy('int_no', 'DESC')->with('member')->with('item')->paginate();

select * from `members` where `members`.`id` in (2, 3, 7, 9, 10, 15, 26, 36, 46, 49, 62, 66, 68, 70, 78, 79, 81)
---
     public function index_advance_pdf(Request $request) {
        $from = date($request->search_date_from);
        $to = date($request->search_date_to);
        $names = $items = \App\Models\Item::find($request->item_id)->name;
        $name = str_replace(" ", "_", $names);
        $datas = $this->table::whereBetween('date', [$from, $to])->where('item_id', 'LIKE', $request->item_id)->with('member')->get();

select * from `members` where `members`.`id` in (2, 19, 64)
---
    public function search_name(Request $request){
        $datas = $this->table::where('item_id', 'LIKE', $request->item_id)->orderBy('int_no', 'DESC')->with('member')->paginate(10)->withQueryString();

select * from `items` where `items`.`id` in (18, 20, 21, 30, 42, 48, 77, 100, 105, 106, 127)
select * from `items` order by `name` asc
---
    public function multiple_out(){
        $datas = $this->table::orderBy('int_no', 'DESC')->with('item')->paginate();
        $rank = $datas->firstItem();
        $items = \App\Models\Item::orderBy('name')->get();

insert into `stocks_outs` (`comment`, `date`, `int_no`, `item_id`, `member_id`, `quantity`, `user_id`) values ('', '2026-08-30', '2608029', '78', '81', '3', 1), ('', '2026-08-30', '2608029', '74', '81', '1', 1), ('', '2026-08-30', '2608029', '21', '81', '2', 1), ('', '2026-08-30', '2608029', '106', '81', '3', 1), ('', '2026-08-30', '2608029', '30', '81', '1', 1), ('', '2026-08-30', '2608029', '84', '81', '1', 1), ('', '2026-08-30', '2608029', '68', '81', '1', 1), ('', '2026-08-30', '2608029', '146', '81', '20', 1), ('', '2026-08-30', '2608029', '144', '81', '20', 1)
insert into `images` (`int_no`, `type`, `user_id`, `name`, `updated_at`, `created_at`) values ('2508025', 'out', 1, 'Scan_0025-1788426199.jpg', '2026-09-03 09:03:19', '2026-09-03 09:03:19')
---
    public function multiple_out_store(Request $request){
        // return response()->json($request->all());
        foreach ($request->item_id as $index => $unit) {
            $units[] = [
        'int_no' =>  $request->input('int_no'),
        'date' =>  $request->input('date'),
        'member_id' =>  $request->input('member_id'),
        'comment' =>  $request->input('comment'),
        'item_id' =>  $request->input('item_id')[$index],
        'quantity' =>  $request->input('quantity')[$index],
        'user_id' => \Auth::id(),
            ];
        }
        $created = \Auth::user()->stocksOut()->insert($units);
        if ($request->file('name')) {
            $filenameWithExt = $request->file('name')->getClientOriginalName();
        $filename = pathinfo($filenameWithExt,PATHINFO_FILENAME);
        $extension =  $request->file('name')->getClientOriginalExtension();
        $filenameToStore = $filename.'-'.time(). '.'. $extension;
        $path = $request->file('name')->storeAs('/public/images/out',$filenameToStore);
        $image = new \App\Models\Image;
        $image->int_no = $request->input('int_no');
        $image->type = 'out';
        $image->user_id = \Auth::id();
        $image->name = $filenameToStore;
        $image->save();