app/Models/Item.php

select * from `stocks_ins` where `stocks_ins`.`item_id` = 18 and `stocks_ins`.`item_id` is not null
---
    public function getStocksInTotalAttribute()
    {
    return $this->stocksIn->sum('quantity');

select * from `stocks_outs` where `stocks_outs`.`item_id` = 18 and `stocks_outs`.`item_id` is not null
---
    public function getStocksOutTotalAttribute()
    {
    return $this->stocksOut->sum('quantity');

select * from `stocks_ins` where `stocks_ins`.`item_id` = 18 and `stocks_ins`.`item_id` is not null
select * from `stocks_outs` where `stocks_outs`.`item_id` = 18 and `stocks_outs`.`item_id` is not null
---
    public function getStocksLeftAttribute()
    {
    return ($this->stocksIn->sum('quantity')- $this->stocksOut->sum('quantity'));